app/controllers/gossip_controller.rb

	def gossip
    @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]